-- Заполнение таблицы Students
INSERT INTO Students (FirstName, LastName, Age, Phone) VALUES
(N'Иван', N'Иванов', 25, '123-456-7890'),
(N'Елена', N'Петрова', 22, '987-654-3210'),
(N'Алексей', N'Сидоров', 28, '555-123-4567'),
(N'Светлана', N'Козлова', 30, '444-987-6543'),
(N'Андрей', N'Смирнов', 26, '111-222-3333'),
(N'Мария', N'Кузнецова', 29, '999-888-7777'),
(N'Павел', N'Васильев', 27, '777-888-9999'),
(N'Ольга', N'Павлова', 24, '666-555-4444'),
(N'Дмитрий', N'Сергеев', 31, '333-444-5555'),
(N'Наталья', N'Игнатьева', 23, '222-333-4444');

-- Заполнение таблицы Locations
INSERT INTO Locations (Name) VALUES
(N'Площадка ГАИ'),
(N'Площадка автошколы');

-- Заполнение таблицы LessonTypes
INSERT INTO LessonTypes (Name) VALUES
(N'Обычное занятие'),
(N'Экзамен');

-- Заполнение таблицы Schedule
INSERT INTO Schedule (LessonDate, StartTime, EndTime, StudentID, LocationID, LessonTypeID, Grade) VALUES
('2023-01-01', '08:00', '09:00', 1, 1, 1, NULL),
('2023-01-01', '09:00', '10:00', 2, 2, 1, NULL),
('2023-01-02', '10:00', '11:00', 3, 1, 1, NULL),
('2023-01-02', '11:00', '12:00', 4, 2, 1, NULL),
('2023-01-03', '13:00', '14:00', 5, 1, 1, NULL),
('2023-01-04', '14:00', '15:00', 6, 2, 1, NULL),
('2023-01-04', '15:00', '16:00', 7, 1, 1, NULL),
('2023-01-05', '16:00', '17:00', 8, 2, 1, NULL),
('2023-01-05', '17:00', '18:00', 9, 1, 1, NULL),
('2023-01-06', '08:00', '09:00', 10, 2, 1, NULL);