-- Заполнение таблицы Students
INSERT INTO Students (FirstName, LastName, BirthDate, Phone) VALUES
(N'Иван', N'Иванов', '2000-05-15', '+375123456789'),
(N'Елена', N'Петрова', '2001-08-20', '+375987654321'),
(N'Алексей', N'Сидоров', '1998-01-10', '+375555123456'),
(N'Светлана', N'Козлова', '1996-04-12', '+375444987654'),
(N'Андрей', N'Смирнов', '1999-07-25', '+375111222333'),
(N'Мария', N'Иванова', '2002-09-30', '+375222333444'),
(N'Павел', N'Петров', '2003-03-05', '+375333444555'),
(N'Ольга', N'Сидорова', '1997-11-20', '+375444555666'),
(N'Дмитрий', N'Козлов', '2000-12-25', '+375555666777'),
(N'Наталья', N'Смирнова', '1995-06-18', '+375666777888');

-- Заполнение таблицы Locations
INSERT INTO Locations (Name, Address, Description) VALUES
(N'Площадка ГАИ', N'ул. Пушкина, 10', N'Площадка для проведения практических занятий по вождению'),
(N'Площадка автошколы', N'пр. Ленина, 25', N'Внутренний двор автошколы для практических занятий');

-- Заполнение таблицы LessonTypes
INSERT INTO LessonTypes (Name, Description, InstructorNotes) VALUES
(N'Обычное занятие', N'Стандартное практическое занятие вождения', N'Подчеркните важность соблюдения правил дорожного движения'),
(N'Экзамен', N'Практический экзамен по вождению', N'Убедитесь, что студент подготовлен к экзамену');

-- Заполнение таблицы Schedule
-- Предположим, что у нас уже есть ID студентов и мест занятий из предыдущих вставок
INSERT INTO Schedule (LessonDate, StartTime, EndTime, StudentID, LocationID, LessonTypeID) VALUES
('2024-02-01', '08:00', '09:00', 1, 1, 1),
('2024-02-02', '09:00', '10:00', 2, 2, 1),
('2024-02-03', '10:00', '11:00', 3, 1, 2),
('2024-02-04', '11:00', '12:00', 4, 2, 2),
('2024-02-05', '13:00', '14:00', 5, 1, 1),
('2024-02-06', '14:00', '15:00', 6, 2, 1),
('2024-02-07', '15:00', '16:00', 7, 1, 1),
('2024-02-08', '16:00', '17:00', 8, 2, 1),
('2024-02-09', '17:00', '18:00', 9, 1, 1),
('2024-02-10', '08:00', '09:00', 10, 2, 2);